bekencorp/bk_avdk_smp/cp/include/soc/bk7259/reg_base.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#pragma once

#include "sdkconfig.h"

#define SOC_S_NS_ADDR_DIFF       (0x10000000)

#if CONFIG_SPE
#define SOC_ADDR_OFFSET          (0)
#define SOC_GET_S_ADDR(addr)     (addr)
#define SOC_GET_NS_ADDR(addr)    ((addr) + SOC_S_NS_ADDR_DIFF)
#else
#define SOC_ADDR_OFFSET          SOC_S_NS_ADDR_DIFF
#define SOC_GET_S_ADDR(addr)     ((addr) - SOC_S_NS_ADDR_DIFF)
#define SOC_GET_NS_ADDR(addr)    (addr)
#endif

#define SOC_DTCM_DATA_BASE       (0x20000000 + SOC_ADDR_OFFSET)

#define SOC_FLASH_DATA_BASE      (0x04000000 + SOC_ADDR_OFFSET)
#define SOC_ROM_DATA_BASE        (0x02000000 + SOC_ADDR_OFFSET)
#define SOC_SRAM0_DATA_BASE      (0x2C000000 + SOC_ADDR_OFFSET) //128K
#define SOC_SRAM0_DATA_SIZE      0x20000
#define SOC_SRAM1_DATA_BASE      (0x2C020000 + SOC_ADDR_OFFSET) //128K
#define SOC_SRAM1_DATA_SIZE      0x20000
#define SOC_SRAM2_DATA_BASE      (0x2C040000 + SOC_ADDR_OFFSET) //128K
#define SOC_SRAM2_DATA_SIZE      0x20000
#define SOC_SRAM3_DATA_BASE      (0x2C100000 + SOC_ADDR_OFFSET) //256K
#define SOC_SRAM3_DATA_SIZE      0x40000
#define SOC_SRAM4_DATA_BASE      (0x2C140000 + SOC_ADDR_OFFSET) //256K
#define SOC_SRAM4_DATA_SIZE      0x40000
#define SOC_SRAM5_DATA_BASE      (0x2C180000 + SOC_ADDR_OFFSET) //256K
#define SOC_SRAM5_DATA_SIZE      0x40000
#define SOC_SRAM6_DATA_BASE      (0x2C1C0000 + SOC_ADDR_OFFSET) //128K
#define SOC_SRAM6_DATA_SIZE      0x20000
#define SOC_SRAM_DATA_END       (SOC_SRAM6_DATA_BASE +SOC_SRAM6_DATA_SIZE)
#define SOC_M55_TCM_BASE         (0x28200000 + SOC_ADDR_OFFSET)
#define SOC_USB_TCM_BASE         (0x29000000 + SOC_ADDR_OFFSET)

#define SOC_RAM_BASE             CONFIG_CP_RAM_ADDR
#define SOC_RAM_SIZE             CONFIG_CP_RAM_SIZE

#if CONFIG_SRAM_DIRECT_ADDR
/*
 * SRAM direct-address (0x2Cxxxxxx) -> peripheral-address (0x28xxxxxx)
 *
 * When CONFIG_SRAM_DIRECT_ADDR is enabled, the CP OS places its data in
 * the 0x2Cxxxxxx SRAM alias (Bit26 set) because the CP core accesses that
 * alias faster. Peripherals (DMA / codec / display / ...) can ONLY access the
 * 0x28xxxxxx SRAM alias, so an SRAM buffer pointer handed to a peripheral must
 * be translated back first.
 *
 * SOC_SRAM_PERI_ADDR() clears Bit26 (0x04000000) to map 0x2Cxxxxxx ->
 * 0x28xxxxxx. It is valid ONLY for 0x2Cxxxxxx addresses (0x2C000000 ~
 * 0x2CFFFFFF); every other address (0x28xxxxxx SRAM, PSRAM, registers, ...)
 * is returned unchanged so the macro is safe to apply unconditionally.
 */
#define SOC_SRAM_DIRECT_ADDR_BIT     (0x04000000U)   /* Bit26 */
#define SOC_SRAM_DIRECT_ADDR_MASK    (0xFF000000U)

#define SOC_SRAM_DIRECT_ADDR_BASE    (0x2C000000U)
#define SOC_SRAM_DIRECT_ADDR_BASE_SECURE    (0x3C000000U)

#define SOC_SRAM_NORMAL_ADDR_BASE    (0x28000000U)
#define SOC_SRAM_NORMAL_ADDR_BASE_SECURE    (0x38000000U)

#define SOC_SRAM_PERI_ADDR(addr) \
    ((((unsigned int)(addr) & SOC_SRAM_DIRECT_ADDR_MASK) == SOC_SRAM_DIRECT_ADDR_BASE) ? \
     ((unsigned int)(addr) & ~SOC_SRAM_DIRECT_ADDR_BIT) : ((unsigned int)(addr)))

#define SOC_SRAM_PERI_ADDR_SECURE(addr) \
    ((((unsigned int)(addr) & SOC_SRAM_DIRECT_ADDR_MASK) == SOC_SRAM_DIRECT_ADDR_BASE_SECURE) ? \
     ((unsigned int)(addr) & ~SOC_SRAM_DIRECT_ADDR_BIT) : ((unsigned int)(addr)))

#define SOC_SRAM_PERI_ADDR_NORMAL(addr) \
    ((((unsigned int)(addr) & SOC_SRAM_DIRECT_ADDR_MASK) == SOC_SRAM_NORMAL_ADDR_BASE) ? \
     ((unsigned int)(addr) | SOC_SRAM_DIRECT_ADDR_BIT) : ((unsigned int)(addr)))

#define SOC_SRAM_PERI_ADDR_NORMAL_SECURE(addr) \
    ((((unsigned int)(addr) & SOC_SRAM_DIRECT_ADDR_MASK) == SOC_SRAM_NORMAL_ADDR_BASE_SECURE) ? \
     ((unsigned int)(addr) | SOC_SRAM_DIRECT_ADDR_BIT) : ((unsigned int)(addr)))
#else
#define SOC_SRAM_PERI_ADDR(addr) (addr)
#define SOC_SRAM_PERI_ADDR_SECURE(addr) (addr)
#define SOC_SRAM_PERI_ADDR_NORMAL(addr) (addr)
#define SOC_SRAM_PERI_ADDR_NORMAL_SECURE(addr) (addr)
#endif /* CONFIG_SRAM_DIRECT_ADDR */


#if CONFIG_PSRAM_INTERLEAVE
#define SOC_PSRAM0_DATA_BASE     ((unsigned int)(0x60000000UL + SOC_ADDR_OFFSET + CONFIG_PSRAM_INTERLEAVE_OFFSET))
#define SOC_PSRAM1_DATA_BASE     ((unsigned int)(0x61000000UL + SOC_ADDR_OFFSET + CONFIG_PSRAM_INTERLEAVE_OFFSET))
#define SOC_QSPI0_DATA_BASE      ((unsigned int)(0x68000000UL + SOC_ADDR_OFFSET + CONFIG_PSRAM_INTERLEAVE_OFFSET))  //TODO:qspi0 whether needs this offset
#define SOC_QSPI1_DATA_BASE      ((unsigned int)(0x6C000000UL + SOC_ADDR_OFFSET + CONFIG_PSRAM_INTERLEAVE_OFFSET))  //TODO:qspi1 whether needs this offset
#define SOC_PSRAM_DATA_BASE      SOC_PSRAM0_DATA_BASE
#else
#define SOC_PSRAM0_DATA_BASE     (0x60000000 + SOC_ADDR_OFFSET)
#define SOC_PSRAM1_DATA_BASE     (0x64000000 + SOC_ADDR_OFFSET)
#define SOC_QSPI0_DATA_BASE      (0x68000000 + SOC_ADDR_OFFSET)
#define SOC_QSPI1_DATA_BASE      (0x6C000000 + SOC_ADDR_OFFSET)
#define SOC_PSRAM_DATA_BASE      SOC_PSRAM0_DATA_BASE
#endif

#define SOC_PSRAM_DATA_SIZE      (0x4000000)
#define SOC_PSRAM_4M_SIZE        (0x400000)
#define SOC_PSRAM_8M_SIZE        (0x800000)
#define SOC_PSRAM_16M_SIZE       (0x1000000)
#define SOC_PSRAM_32M_SIZE       (0x2000000)
#define SOC_QSPI0_DATA_SIZE      (0x4000000)
#define SOC_QSPI1_DATA_SIZE      (0x4000000)

#define SOC_SYS_REG_BASE         (0x44010000 + SOC_ADDR_OFFSET)
#define SOC_SYSTEM_REG_BASE      (0x44010000 + SOC_ADDR_OFFSET)
#define SOC_SYS_AONP_REG_BASE    (0x44010000 + SOC_ADDR_OFFSET)

#define SOC_AON_PMU_REG_BASE     (0x44000000 + SOC_ADDR_OFFSET)

/* CP-domain MPC instances (programmed by the CP MPC driver). OTP1 has no MPC. */
#define SOC_MPC_FLASH_REG_BASE   (0x448B0000 + SOC_ADDR_OFFSET)
#define SOC_MPC_SMEM0_REG_BASE   (0x448C0000 + SOC_ADDR_OFFSET)
#define SOC_MPC_SMEM1_REG_BASE   (0x448D0000 + SOC_ADDR_OFFSET)
#define SOC_MPC_SMEM2_REG_BASE   (0x448E0000 + SOC_ADDR_OFFSET)
#define SOC_MPC_OTP2_REG_BASE    (0x448F0000 + SOC_ADDR_OFFSET)
/* AP-domain MPC instances (only reachable once the AP power domain is up;
 * programmed by direct register access, not by the CP MPC driver). */
#define SOC_MPC_NPU_S_REG_BASE   (0x48200000 + SOC_ADDR_OFFSET)
#define SOC_MPC_SMEM3_REG_BASE   (0x48210000 + SOC_ADDR_OFFSET)
#define SOC_MPC_SMEM4_REG_BASE   (0x48220000 + SOC_ADDR_OFFSET)
#define SOC_MPC_SMEM5_REG_BASE   (0x48230000 + SOC_ADDR_OFFSET)
#define SOC_MPC_SMEM6_REG_BASE   (0x48240000 + SOC_ADDR_OFFSET)
#define SOC_MPC_PSRAM_REG_BASE   (0x48250000 + SOC_ADDR_OFFSET)
#define SOC_MPC_PSRAM1_REG_BASE  (0x48260000 + SOC_ADDR_OFFSET)
#define SOC_MPC_PSRAM_V_REG_BASE (0x48270000 + SOC_ADDR_OFFSET)
#define SOC_MPC_QSPI0_REG_BASE   (0x48280000 + SOC_ADDR_OFFSET)
#define SOC_MPC_QSPI1_REG_BASE   (0x48290000 + SOC_ADDR_OFFSET)

#define SOC_AON_WDT_REG_BASE     (0x44000600 + SOC_ADDR_OFFSET)
#define SOC_AON_GPIO_REG_BASE    (0x44000400 + SOC_ADDR_OFFSET)
#define SOC_AON_RTC_REG_BASE     (0x44000200 + SOC_ADDR_OFFSET)
#define SOC_FLASH_REG_BASE       (0x44030000 + SOC_ADDR_OFFSET)
#define SOC_MBOX0_REG_BASE       (0x45000000 + SOC_ADDR_OFFSET)
#define SOC_HSPL0_REG_BASE       (0x45010000 + SOC_ADDR_OFFSET)
#define SOC_HSPL1_REG_BASE       (0x480C0000 + SOC_ADDR_OFFSET)
#define SOC_GENER_DMA_REG_BASE   (0x45020000 + SOC_ADDR_OFFSET)
#define SOC_UART0_REG_BASE       (0x44820000 + SOC_ADDR_OFFSET)
#define SOC_UART1_REG_BASE       (0x45830000 + SOC_ADDR_OFFSET)
#define SOC_UART2_REG_BASE       (0x45840000 + SOC_ADDR_OFFSET)
#define SOC_UART3_REG_BASE       (0x45820000 + SOC_ADDR_OFFSET)
#define SOC_UART4_REG_BASE       (0x458e0000 + SOC_ADDR_OFFSET)

#define SOC_CAN0_REG_BASE        (0x43010000 + SOC_ADDR_OFFSET)
#define SOC_CAN1_REG_BASE        (0x43020000 + SOC_ADDR_OFFSET)
#define SOC_TIMER0_REG_BASE      (0x44810000 + SOC_ADDR_OFFSET)
#define SOC_SPI0_REG_BASE        (0x44870000 + SOC_ADDR_OFFSET)
#define SOC_SPI_REG_BASE         SOC_SPI0_REG_BASE
#define SOC_EFUSE_REG_BASE       (0x44850000 + SOC_ADDR_OFFSET)
#define SOC_MEM_CHECK_REG_BASE   (0x44890000 + SOC_ADDR_OFFSET)
#define SOC_CKMN_REG_BASE        (0x44830000 + SOC_ADDR_OFFSET)
#define SOC_I2C3_REG_BASE        (0x44840000 + SOC_ADDR_OFFSET)

#define SOC_SPI1_REG_BASE        (0x45870000 + SOC_ADDR_OFFSET)
#define SOC_SPI2_REG_BASE        (0x45880000 + SOC_ADDR_OFFSET)
#define SOC_SPI3_REG_BASE        (0x45860000 + SOC_ADDR_OFFSET)
#define SOC_I2C0_REG_BASE        (0x45850000 + SOC_ADDR_OFFSET)
#define SOC_TIMER1_REG_BASE      (0x45800000 + SOC_ADDR_OFFSET)
#define SOC_TIMER2_REG_BASE      (0x458c0000 + SOC_ADDR_OFFSET)
#define SOC_TIMER3_REG_BASE      (0x458d0000 + SOC_ADDR_OFFSET)
#define SOC_PWM_REG_BASE         (0x458a0000 + SOC_ADDR_OFFSET)
#define SOC_SADC_REG_BASE        (0x45890000 + SOC_ADDR_OFFSET)
#define SOC_I3C_REG_BASE         (0x458b0000 + SOC_ADDR_OFFSET)  /* Beken strap block */
#define SOC_I3C_IP_REG_BASE      (0x458b8000 + SOC_ADDR_OFFSET)  /* I3C controller (+0x8000) */

#define SOC_AUD_REG_BASE         (0x4101A000 + SOC_ADDR_OFFSET)
#define SOC_AUDIO_REG_REG_BASE   (0x4101A000 + SOC_ADDR_OFFSET)
#define SOC_AUDIO_FIFO_REG_BASE  (0x41010000 + SOC_ADDR_OFFSET)
#define SOC_I2S_REG_BASE         (0x41120000 + SOC_ADDR_OFFSET)
#define SOC_I2S1_REG_BASE        (0x41130000 + SOC_ADDR_OFFSET)
#define SOC_I2S2_REG_BASE        (0x41140000 + SOC_ADDR_OFFSET)
#define SOC_I2S3_REG_BASE        (0x41150000 + SOC_ADDR_OFFSET)
#define SOC_I2S4_REG_BASE        (0x41160000 + SOC_ADDR_OFFSET)
#define SOC_SPDIF_REG_BASE       (0x41100000 + SOC_ADDR_OFFSET)
#define SOC_SPDIF1_REG_BASE      (0x41110000 + SOC_ADDR_OFFSET)
#define SOC_CEC_REG_BASE         (0x41170000 + SOC_ADDR_OFFSET)
#define SOC_IPI_REG_BASE         (0x458f0000 + SOC_ADDR_OFFSET)
#define SOC_XDAC0_REG_BASE       (0x45900000 + SOC_ADDR_OFFSET)
#define SOC_XDAC1_REG_BASE       (0x45910000 + SOC_ADDR_OFFSET)
#define SOC_XVR_REG_BASE         (0x46280000 + SOC_ADDR_OFFSET)
#define SOC_BK24_REG_BASE        (0x462c0000 + SOC_ADDR_OFFSET)
#define SOC_LA_REG_BASE          (0x43000000 + SOC_ADDR_OFFSET)

#define SOC_OTP_REG_BASE         (0x42100000 + SOC_ADDR_OFFSET)
#define SOC_PPRO_REG_BASE        (0x44050000 + SOC_ADDR_OFFSET)
#define SOC_SCR0_REG_BASE        (0x43100000 + SOC_ADDR_OFFSET)
#define SOC_SCR_REG_BASE         (0x43100000 + SOC_ADDR_OFFSET)
#define SOC_LIN0_REG_BASE        (0x43120000 + SOC_ADDR_OFFSET)
#define SOC_LIN_REG_BASE         (0x43120000 + SOC_ADDR_OFFSET)
#define SOC_IRDA0_REG_BASE       (0x43140000 + SOC_ADDR_OFFSET)
#define SOC_IRDA1_REG_BASE       (0x43150000 + SOC_ADDR_OFFSET)
#define SOC_IRDA2_REG_BASE       (0x43160000 + SOC_ADDR_OFFSET)
#define SOC_IRDA3_REG_BASE       (0x43170000 + SOC_ADDR_OFFSET)

#define SOC_PSRAM_CAL_REG_BASE   (0x46080000 + SOC_ADDR_OFFSET)
#define SOC_MAC_CRM_REG_BASE     (0x46100000 + SOC_ADDR_OFFSET)
#define SOC_MAC_CORE_REG_BASE    (0x46110000 + SOC_ADDR_OFFSET)
#define SOC_MAC_PL_REG_BASE      (0x46118000 + SOC_ADDR_OFFSET)
#define SOC_RW_PTA_REG_BASE      (0x46120000 + SOC_ADDR_OFFSET)
#define SOC_RW_HSU_REG_BASE      (0x46130000 + SOC_ADDR_OFFSET)
#define SOC_HDM_CFG_REG_BASE     (0x46180000 + SOC_ADDR_OFFSET)
#define SOC_AGCMEM_REG_BASE      (0x4618A000 + SOC_ADDR_OFFSET)
#define SOC_RIUKARST_REG_BASE    (0x4618B000 + SOC_ADDR_OFFSET)
#define SOC_RC_REG_BASE          (0x4618C000 + SOC_ADDR_OFFSET)
#define SOC_TRX_REG_BASE         (0x4618C200 + SOC_ADDR_OFFSET)
#define SOC_POWTBL_REG_BASE      (0x4618C400 + SOC_ADDR_OFFSET)
#define SOC_PEAKCWMEM_REG_BASE   (0x4618D000 + SOC_ADDR_OFFSET)
#define SOC_PHY_CRM_REG_BASE     (0x46185000 + SOC_ADDR_OFFSET)
#define SOC_MAC_BYPASS_REG_BASE  (0x46186000 + SOC_ADDR_OFFSET)
#define SOC_DPDTBL_REG_BASE      (0x46190000 + SOC_ADDR_OFFSET)
#define SOC_BTDM_REG_BASE        (0x46200000 + SOC_ADDR_OFFSET)
#define SOC_THREAD_REG_BASE      (0x46300000 + SOC_ADDR_OFFSET)

#define SOC_BKRW_REG_BASE        (0x46210000 + SOC_ADDR_OFFSET)
#define SOC_OTP_AHB_BASE         (0x42010000 + SOC_ADDR_OFFSET)
#define SOC_OTP_APB_BASE         (0x42100000 + SOC_ADDR_OFFSET)
#define SOC_SHANHAI_BASE         (0x42110000 + SOC_ADDR_OFFSET)
#define SOC_WWDT_REG_BASE        (0xE0050000)

/* AP start */
#define SOC_SYS_AHBP_REG_BASE    (0x48000000 + SOC_ADDR_OFFSET)
#define SOC_QSPI0_REG_BASE       (0x48020000 + SOC_ADDR_OFFSET)
#define SOC_QSPI1_REG_BASE       (0x48030000 + SOC_ADDR_OFFSET)
#define SOC_SDIO0_REG_BASE       (0x48040700 + SOC_ADDR_OFFSET)
#define SOC_SDIO1_REG_BASE       (0x48050700 + SOC_ADDR_OFFSET)
#define SOC_PSRAM0_REG_BASE      (0x48060000 + SOC_ADDR_OFFSET)
#define SOC_PSRAM1_REG_BASE      (0x48070000 + SOC_ADDR_OFFSET)
#define SOC_PSRAM_REG_BASE       SOC_PSRAM0_REG_BASE
#define SOC_UART5_REG_BASE       (0x48110000 + SOC_ADDR_OFFSET)
#define SOC_TIMER4_REG_BASE      (0x48120000 + SOC_ADDR_OFFSET)
#define SOC_TIMER5_REG_BASE      (0x48130000 + SOC_ADDR_OFFSET)

/* AP-side peripherals visible on the shared SoC bus; CP needs these
 * physical bases solely for AP heartbeat-timeout register snapshots. */
#define SOC_HPDMA_REG_BASE       (0x4C300000 + SOC_ADDR_OFFSET)
#define SOC_ISP_REG_BASE         (0x4C040000 + SOC_ADDR_OFFSET)
#define SOC_H26E_REG_BASE        (0x4C100000 + SOC_ADDR_OFFSET)
#define SOC_H26D_REG_BASE        (0x4C210000 + SOC_ADDR_OFFSET)
#define SOC_DPU_REG_BASE         (0x4C2C0000 + SOC_ADDR_OFFSET)
#define SOC_GPU_REG_BASE         (0x4C280000 + SOC_ADDR_OFFSET)
#define SOC_PPHS_REG_BASE        (0x480D0000 + SOC_ADDR_OFFSET)
/* AP end */


// The following base addresses not exist in the CP address mapping.
#define SOC_IRDA_REG_BASE        SOC_IRDA0_REG_BASE
#define SOC_SDIO_REG_BASE        SOC_SDIO0_REG_BASE

